功能 功能0(dm)
    //这个功能是 打板投篮
    按(晃,dm)
    等(40)
    投篮(0,dm)
    等(300)
    弹(晃,dm)
结束

功能 功能1(dm)
    
    //这个功能是 左手漂移投
    
    按(加,dm)
    
    
    
    按(左,dm)
    
    
    动作(600,1)
    
    
    按(五,dm)
    弹(加,dm)
    特殊投篮等(1)
    弹(左,dm)
    弹(五,dm)
    
    
    
    
结束
功能 功能2(dm)
    
    
    //这个功能是 右手漂移投
    
    
    
    按(加,dm)
    
    
    
    按(右,dm)
    
    
    动作(600,2)
    
    
    按(二,dm)
    弹(加,dm)
    特殊投篮等(2)
    弹(右,dm)
    弹(二,dm)
结束
功能 功能3(dm)
    //这个功能是 左连续瞬移滑步
    
    
    
    
    
    按(晃,dm)
    按(加,dm)
    按(右,dm)
    等(120)
    弹(加,dm)
    弹(右,dm)
    等(50)
    
    按(上,dm)
    动作(490,4)
    按(右,dm)
    
    按(加,dm)
    等(30)
    弹(上,dm)
    
    
    等(200)
    
    弹(右,dm)
    等(200)
    弹(加,dm)
    
    弹(晃,dm)
    
    
结束
功能 功能4(dm)
    //这个功能是 右连续瞬移滑步
    
    
    
    
    
    按(晃,dm)
    按(加,dm)
    按(左,dm)
    等(120)
    弹(加,dm)
    弹(左,dm)
    
    等(50)
    按(上,dm)
    动作(490,4)
    
    
    
    弹(上,dm)
    按(左,dm)
    按(加,dm)
    
    
    等(200)
    弹(左,dm)
    
    等(200)
    弹(加,dm)
    
    弹(晃,dm)
    
    
    
    
    
结束
功能 功能5(dm)
    //这个功能是 万能急停鬼步
    
    
    
    
    按(上,dm)
    
    
    
    动作(350,5)
    弹(上,dm)
    按(晃,dm)
    
    按(下,dm)
    等(180)
    弹(晃,dm)
    弹(下,dm)
    
    
    
    
    按(右,dm)
    
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    弹(右,dm)
    等(520)
    投篮(5,dm)
    
结束
功能 功能6(dm)
    
    
    //左滑步鬼步1
    等(300)
    按(晃,dm)
    
    按(加,dm)
    
    按(左,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(左,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    
    按(晃,dm)
    按(加,dm)
    按(右,dm)
    动作(210,6)
    弹(晃,dm)
    弹(右,dm)
    按(上,dm)
    动作(525,6,2.5)
    弹(上,dm)
    按(右,dm)
    动作(315,6,1.5)
    弹(右,dm)
    弹(加,dm)
    
    
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    等(500)
    
    
    
    
    投篮(6,dm)
结束
功能 功能7(dm)
    //滑步鬼步1
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    按(右,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(右,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    
    按(晃,dm)
    按(加,dm)
    按(左,dm)
    动作(210,7)
    弹(晃,dm)
    弹(左,dm)
    按(上,dm)
    动作(525,7,2.5)
    弹(上,dm)
    按(左,dm)
    动作(315,7,1.5)
    弹(左,dm)
    弹(加,dm)
    
    
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    等(500)
    
    投篮(7,dm)
结束
功能 功能8(dm)
    //这个功能是 左疾风步鬼步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    
    按(下,dm)
    等(500)
    弹(下,dm)
    
    等(320)
    
    
    
    弹(晃,dm)
    等(50)
    
    
    
    按(晃,dm)
    
    按(右,dm)
    等(350)
    弹(晃,dm)
    
    弹(右,dm)
    等(200)
    
    
    按(右,dm)
    按(晃,dm)
    等(400)
    
    弹(右,dm)
    弹(晃,dm)
    弹(加,dm)
    
    
    
    
    
    
    按(左,dm)
    按(晃,dm)
    动作(600,8)
    弹(晃,dm)
    弹(左,dm)
    
    
    按(加,dm)
    按(上,dm)
    动作(1500,8,2.258)
    
    
    弹(上,dm)
    
    
    
    
    
    
    
    
    按(右,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    弹(右,dm)
    等(400)
    
    
    
    投篮(8,dm)
    弹(加,dm)
结束
功能 功能9(dm)
    //这个功能是 右疾风步鬼步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    
    按(下,dm)
    等(500)
    弹(下,dm)
    
    等(320)
    
    
    
    弹(晃,dm)
    等(50)
    
    
    
    按(晃,dm)
    
    按(左,dm)
    等(350)
    弹(晃,dm)
    
    弹(左,dm)
    等(200)
    
    
    按(左,dm)
    按(晃,dm)
    等(400)
    
    弹(左,dm)
    弹(晃,dm)
    弹(加,dm)
    
    
    按(右,dm)
    按(晃,dm)
    动作(600,9)
    弹(晃,dm)
    弹(右,dm)
    按(加,dm)
    按(上,dm)
    动作(1500,9,2.258)
    
    
    弹(上,dm)
    
    
    
    
    
    
    
    按(左,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    弹(左,dm)
    等(400)
    
    
    投篮(9,dm)
    弹(加,dm)
结束
功能 功能10(dm)
    //这个功能是 左基础反瞬鬼步1
    等(300)
    按(晃,dm)
    
    按(加,dm)
    
    按(左,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(左,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    
    按(晃,dm)
    按(加,dm)
    按(右,dm)
    动作(110,10,0.15)
    弹(右,dm)
    弹(加,dm)
    按(左,dm)
    动作(950,10)
    弹(晃,dm)
    动作(127,10,0.12)
    弹(左,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    等(400)
    投篮(10,dm)
结束
功能 功能11(dm)
    
    
    
    //这个功能是 右基础反瞬鬼步1
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    按(右,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(右,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    按(晃,dm)
    按(加,dm)
    按(左,dm)
    动作(110,10,0.15)
    弹(左,dm)
    弹(加,dm)
    按(右,dm)
    动作(950,10)
    弹(晃,dm)
    动作(127,10,0.12)
    弹(右,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    等(400)
    投篮(11,dm)
结束

功能 功能12(dm)
    
    //这个功能是 后拉俯冲鬼步
    等(300)
    按(右,dm)
    动作(926,12,2.66)
    弹(右,dm)
    按(下,dm)
    动作(206,12,0.66)
    弹(下,dm)
    按(加,dm)
    按(上,dm)
    动作(310,12)
    
    按(左,dm)
    动作(206,12,0.66)
    弹(上,dm)
    动作(930,12,3)
    弹(左,dm)
    弹(加,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    等(500)
    
    投篮(12,dm)
    
    
结束
功能 功能13(dm)
    
    //这个功能是 后拉俯冲鬼步
    等(300)
    按(左,dm)
    动作(926,13,2.66)
    弹(左,dm)
    按(下,dm)
    动作(206,13,0.66)
    弹(下,dm)
    按(加,dm)
    按(上,dm)
    动作(310,13)
    
    按(右,dm)
    动作(206,13,0.66)
    弹(上,dm)
    动作(930,13,3)
    弹(右,dm)
    弹(加,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    等(500)
    
    投篮(13,dm)
结束

功能 功能14(dm)
    //这个功能是 左快速疾风步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    
    按(下,dm)
    等(400)
    弹(下,dm)
    
    等(800)
    
    弹(加,dm)
    
    弹(晃,dm)
    等(150)
    
    按(晃,dm)
    按(加,dm)
    按(右,dm)
    等(231)
    弹(右,dm)
    弹(加,dm)
    按(左,dm)
    动作(640,14)
    弹(晃,dm)
    弹(左,dm)
    
    按(加,dm)
    
    
    按(上,dm)
    动作(1600,14,3.1428)
    
    
    
    
    弹(上,dm)
    等(200)
    
    弹(加,dm)
    
    
    
    
    
    
结束
功能 功能15(dm)
    //这个功能是 右快速疾风步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    
    按(下,dm)
    等(400)
    弹(下,dm)
    
    等(800)
    
    弹(加,dm)
    
    弹(晃,dm)
    等(150)
    
    按(晃,dm)
    按(加,dm)
    按(左,dm)
    等(231)
    弹(左,dm)
    弹(加,dm)
    按(右,dm)
    动作(640,15)
    弹(晃,dm)
    弹(右,dm)
    
    按(加,dm)
    
    
    按(上,dm)
    动作(1600,15,1.5277)
    
    
    
    
    弹(上,dm)
    
    等(200)
    弹(加,dm)
    
    
    
    
    
    
结束
功能 功能16(dm)
    
    
    //右原地持球鬼步
    等(100)
    按(晃,dm)
    按(左,dm)
    等(35)
    弹(晃,dm)
    弹(左,dm)
    等(100)
    按(加,dm)
    按(下,dm)
    按(右,dm)
    等(50)
    弹(下,dm)
    等(130)
    弹(加,dm)
    弹(右,dm)
    动作(610,16)
    按(左,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(左,dm)
    弹(晃,dm)
    弹(板,dm)
    等(400)
    
    投篮(16,dm)
结束

功能 功能17(dm)
    
    //左原地持球鬼步
    等(100)
    按(晃,dm)
    按(右,dm)
    等(35)
    弹(晃,dm)
    弹(右,dm)
    等(100)
    按(加,dm)
    按(下,dm)
    按(左,dm)
    等(50)
    弹(下,dm)
    等(130)
    弹(加,dm)
    弹(左,dm)
    动作(610,17)
    按(右,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(右,dm)
    弹(晃,dm)
    弹(板,dm)
    等(400)
    投篮(17,dm)
结束
功能 功能18(dm)
    //这个功能是 左靠打疾风鬼步
    等(300)
    按(晃,dm)
    按(加,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    按(加,dm)
    按(上,dm)
    动作(200,18)
    弹(上,dm)
    按(右,dm)
    动作(600,18,4.58)
    弹(加,dm)
    弹(右,dm)
    按(左,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(左,dm)
    弹(晃,dm)
    弹(板,dm)
    
    等(510)
    投篮(18,dm)
    
    
    
    
结束
功能 功能19(dm)
    //这个功能是 右靠打疾风鬼步
    等(300)
    按(晃,dm)
    按(加,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    按(加,dm)
    按(上,dm)
    动作(200,19)
    弹(上,dm)
    按(左,dm)
    动作(600,19,4.58)
    弹(加,dm)
    弹(左,dm)
    按(右,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(右,dm)
    弹(晃,dm)
    弹(板,dm)
    
    等(510)
    投篮(19,dm)
结束
功能 功能20(dm)
    //这个功能是 背运鬼步1
    等(100)
    按(加,dm)
    按(左,dm)
    等(400)
    弹(左,dm)
    弹(加,dm)
    按(左,dm)
    
    按(下,dm)
    
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    
    
    
    
    按(左,dm)
    动作(970,20)
    弹(左,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    等(500)
    投篮(20,dm)
    
    
结束
功能 功能21(dm)
    //这个功能是 背运鬼步2
    等(100)
    按(加,dm)
    按(右,dm)
    等(400)
    弹(右,dm)
    弹(加,dm)
    
    按(右,dm)
    
    按(下,dm)
    
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    
    
    
    
    按(右,dm)
    动作(970,21)
    弹(右,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    等(500)
    
    投篮(21,dm)
    
    
    
结束
功能 功能22(dm)
    //这个功能是 左快速疾风步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    
    按(下,dm)
    等(400)
    弹(下,dm)
    
    等(800)
    
    弹(加,dm)
    
    弹(晃,dm)
    等(150)
    
    按(晃,dm)
    按(加,dm)
    按(右,dm)
    等(231)
    弹(右,dm)
    弹(加,dm)
    按(左,dm)
    动作(600,22)
    弹(晃,dm)
    弹(左,dm)
    
    按(加,dm)
    
    
    按(上,dm)
    动作(1400,22,3.1428)
    
    
    
    
    弹(上,dm)
    
    
    弹(加,dm)
    
    
    
    按(左,dm)
    
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    
    弹(左,dm)
    等(400)
    投篮(22,dm)
    
结束
功能 功能23(dm)
    //这个功能是 右快速疾风步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    
    按(下,dm)
    等(400)
    弹(下,dm)
    
    等(800)
    
    弹(加,dm)
    
    弹(晃,dm)
    等(150)
    
    按(晃,dm)
    按(加,dm)
    按(左,dm)
    等(231)
    弹(左,dm)
    弹(加,dm)
    按(右,dm)
    动作(600,23)
    弹(晃,dm)
    弹(右,dm)
    
    按(加,dm)
    
    
    按(上,dm)
    动作(1400,23,1.5277)
    
    
    
    
    弹(上,dm)
    
    
    弹(加,dm)
    
    
    
    按(右,dm)
    
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    
    弹(右,dm)
    等(400)
    投篮(23,dm)
结束




功能 功能24(dm)
    //这个功能是 左靠打瞬移滑步换手鬼步
    
    等(300)
    按(晃,dm)
    
    按(加,dm)
    
    按(左,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(左,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    
    按(加,dm)
    按(晃,dm)
    按(右,dm)
    等(150)
    弹(加,dm)
    弹(右,dm)
    按(上,dm)
    等(400)
    弹(晃,dm)
    
    
    弹(上,dm)
    
    
    按(加,dm)
    按(下,dm)
    按(右,dm)
    动作(600,24)
    弹(下,dm)
    弹(右,dm)
    
    
    按(上,dm)
    动作(740,24,1.23076)
    
    
    
    
    弹(上,dm)
    弹(加,dm)
    按(右,dm)
    
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    
    弹(右,dm)
    
    等(400)
    投篮(24,dm)
    
    
    
结束
功能 功能25(dm)
    
    //这个功能是 右靠打瞬移滑步换手鬼步
    
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    按(右,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(右,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    按(加,dm)
    按(晃,dm)
    按(左,dm)
    等(150)
    弹(加,dm)
    弹(左,dm)
    按(上,dm)
    等(400)
    弹(晃,dm)
    
    
    弹(上,dm)
    
    
    按(加,dm)
    按(下,dm)
    按(左,dm)
    动作(600,24)
    弹(下,dm)
    弹(左,dm)
    
    
    按(上,dm)
    动作(740,24,1.23076)
    
    
    
    
    弹(上,dm)
    弹(加,dm)
    按(左,dm)
    
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    
    弹(左,dm)
    
    等(400)
    投篮(25,dm)
    
    
结束

功能 功能26(dm)
    //这个功能是 左靠打瞬移蛇步
    
    
    
    等(200)
    弹(晃,dm)
    弹(加,dm)
    等(50)
    
    
    按(加,dm)
    按(晃,dm)
    按(右,dm)
    等(180)
    弹(加,dm)
    弹(右,dm)
    
    
    
    按(上,dm)
    动作(720,26)
    
    
    
    弹(上,dm)
    等(35)
    
    按(右,dm)
    等(150)
    
    弹(右,dm)
    
    
    等(50)
    
    按(左,dm)
    等(150)
    
    弹(左,dm)
    
    等(200)
    
    弹(晃,dm)
    
    
结束
功能 功能27(dm)
    //这个功能是 右靠打瞬移蛇步
    
    
    
    等(200)
    弹(晃,dm)
    弹(加,dm)
    等(50)
    
    
    按(加,dm)
    按(晃,dm)
    按(左,dm)
    等(180)
    弹(加,dm)
    弹(左,dm)
    
    
    
    按(上,dm)
    动作(720,27)
    
    
    
    弹(上,dm)
    等(35)
    
    按(左,dm)
    等(150)
    
    弹(左,dm)
    
    
    等(50)
    
    按(右,dm)
    等(150)
    
    弹(右,dm)
    
    等(200)
    
    弹(晃,dm)
    
结束
功能 功能28(dm)
    
    //这个功能是 左靠打瞬移
    等(300)
    按(晃,dm)
    
    按(加,dm)
    
    按(左,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(左,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    
    
    等(50)
    按(加,dm)
    按(晃,dm)
    按(右,dm)
    等(120)
    弹(加,dm)
    弹(右,dm)
    
    弹(晃,dm)
    
    
    
    
    //这个功能是 右手漂移投
    
    
    按(右,dm)
    等(500)
    
    
    
    
    
    按(二,dm)
    弹(加,dm)
    特殊投篮等(2)
    弹(右,dm)
    弹(二,dm)
    
    
    
    
结束
功能 功能29(dm)
    
    
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    按(右,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(右,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    //这个功能是 右靠打瞬移
    
    等(100)
    弹(晃,dm)
    弹(加,dm)
    等(50)
    按(加,dm)
    按(晃,dm)
    按(左,dm)
    等(120)
    弹(加,dm)
    弹(左,dm)
    
    
    弹(晃,dm)
    
    
    
    //这个功能是 左手漂移投
    
    按(左,dm)
    等(500)
    
    
    
    
    按(五,dm)
    弹(加,dm)
    特殊投篮等(1)
    弹(左,dm)
    弹(五,dm)
    
结束
功能 功能30(dm)
    
    //这个功能是 左靠打瞬移鬼步
    
    
    按(加,dm)
    按(晃,dm)
    按(右,dm)
    等(120)
    弹(加,dm)
    
    动作(585,30)
    
    弹(晃,dm)
    弹(右,dm)
    
    按(左,dm)
    
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    弹(左,dm)
    等(400)
    投篮(30,dm)
    
    
结束


功能 功能31(dm)
    //这个功能是 右靠打瞬移鬼步
    
    
    按(加,dm)
    按(晃,dm)
    按(左,dm)
    等(120)
    弹(加,dm)
    
    动作(585,31)
    
    弹(晃,dm)
    弹(左,dm)
    
    按(右,dm)
    
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    弹(右,dm)
    等(400)
    投篮(31,dm)
    
结束
功能 功能32(dm)
    //这个功能是 进阶左瞬移漂移
    
    按(加,dm)
    按(晃,dm)
    按(右,dm)
    等(120)
    弹(加,dm)
    
    动作(645,32)
    
    弹(晃,dm)
    
    
    
    
    按(二,dm)
    弹(加,dm)
    特殊投篮等(2)
    弹(右,dm)
    弹(二,dm)
    弹(加,dm)
    
结束
功能 功能33(dm)
    
    //这个功能是 进阶右瞬移漂移
    
    按(加,dm)
    按(晃,dm)
    按(左,dm)
    等(120)
    弹(加,dm)
    
    动作(645,33)
    
    弹(晃,dm)
    
    
    按(五,dm)
    弹(加,dm)
    特殊投篮等(1)
    弹(左,dm)
    弹(五,dm)
    弹(加,dm)
    
结束










功能 功能34(dm)
    //这个功能是 左罚球线疾风步
    
    
    等(300)
    按(晃,dm)
    
    按(加,dm)
    
    按(左,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(左,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    
    
    按(加,dm)
    
    弹(晃,dm)
    等(50)
    按(右,dm)
    动作(300,36)
    弹(右,dm)
    按(下,dm)
    动作(350,36)
    弹(下,dm)
    按(上,dm)
    动作(2000,36,7.3333)
    弹(上,dm)
    
    
    
    
    按(右,dm)
    
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    弹(右,dm)
    等(400)
    投篮(34,dm)
    弹(加,dm)
    
    
结束
功能 功能35(dm)
    //这个功能是 右罚球线疾风步
    等(300)
    按(晃,dm)
    
    按(加,dm)
    等(120)
    按(右,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(右,dm)
    等(120)
    
    弹(加,dm)
    等(400)
    弹(晃,dm)
    
    按(加,dm)
    
    弹(晃,dm)
    等(50)
    按(左,dm)
    动作(300,36)
    弹(左,dm)
    按(下,dm)
    动作(350,36)
    弹(下,dm)
    按(上,dm)
    动作(2000,36,7.3333)
    弹(上,dm)
    
    
    
    
    按(左,dm)
    
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    弹(左,dm)
    等(400)
    投篮(35,dm)
    弹(加,dm)
    
结束
功能 功能36(dm)
    //这个功能是 左罚球线疾风步
    
    按(加,dm)
    
    弹(晃,dm)
    等(50)
    按(右,dm)
    动作(300,36)
    弹(右,dm)
    按(下,dm)
    动作(350,36,1.3333)
    弹(下,dm)
    按(上,dm)
    动作(1700,36,7.3333)
    弹(上,dm)
    等(400)
    弹(加,dm)
    
    
结束
功能 功能37(dm)
    //这个功能是 右罚球线疾风步
    
    按(加,dm)
    
    弹(晃,dm)
    等(50)
    按(左,dm)
    动作(300,36)
    弹(左,dm)
    按(下,dm)
    动作(350,36,1.3333)
    弹(下,dm)
    按(上,dm)
    动作(1700,36,7.3333)
    弹(上,dm)
    等(400)
    弹(加,dm)
    
    
结束
功能 功能38(dm)
    //这个功能是 跳步投篮
    按(加,dm)
    按(上,dm)
    动作(750,38)
    弹(上,dm)
    
    弹(加,dm)
    按(右,dm)
    
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(晃,dm)
    弹(板,dm)
    弹(右,dm)
    等(510)
    投篮(38,dm)
结束
功能 功能39(dm)
    
    投篮(39,dm)
    
    
结束
功能 功能40(dm)
    
    
    
    
    投篮(40,dm)
    
    
    
    
    
结束
功能 功能41(dm)
    投篮(41,dm)
结束
功能 功能42(dm)
    投篮(42,dm)
结束
功能 功能43(dm)
    //这个功能是 原地换手鬼步
    
    
    
    
    按(右,dm)
    动作(500,43)
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    等(300)
    弹(右,dm)
    
    等(100)
    投篮(43,dm)
结束
功能 功能44(dm)
    //这个功能是 原地换手鬼步
    
    
    
    
    按(左,dm)
    动作(500,44)
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    等(300)
    弹(左,dm)
    
    等(100)
    投篮(44,dm)
结束
功能 功能45(dm)
    //这个功能是 左背运右转身
    
    按(加,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(上,dm)
    按(右,dm)
    等(30)
    弹(上,dm)
    弹(右,dm)
    等(30)
    按(上,dm)
    等(30)
    弹(上,dm)
    弹(加,dm)
    
    等(200)
    按(上,dm)
    等(60)
    弹(上,dm)
    按(上,dm)
    按(右,dm)
    等(30)
    弹(上,dm)
    弹(右,dm)
    按(晃,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(上,dm)
    按(左,dm)
    等(30)
    弹(上,dm)
    弹(左,dm)
    等(30)
    按(上,dm)
    等(70)
    弹(上,dm)
    弹(晃,dm)
结束
功能 功能46(dm)
    //这个功能是 右背运左转身
    
    按(加,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(上,dm)
    按(左,dm)
    等(30)
    弹(上,dm)
    弹(左,dm)
    等(30)
    按(上,dm)
    等(30)
    弹(上,dm)
    弹(加,dm)
    等(200)
    
    按(上,dm)
    等(60)
    弹(上,dm)
    按(上,dm)
    按(左,dm)
    等(30)
    弹(上,dm)
    弹(左,dm)
    按(晃,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(上,dm)
    按(右,dm)
    等(30)
    弹(上,dm)
    弹(右,dm)
    等(30)
    按(上,dm)
    等(70)
    弹(上,dm)
    弹(晃,dm)
结束
功能 功能47(dm)
    等(30)
    按(下,dm)
    投篮(47,dm)
    弹(下,dm)
结束
功能 功能48(dm)
    
结束
功能 功能49(dm)
    //这个功能是 快速疾风步
    
    
    
    
    按(晃,dm)
    按(加,dm)
    按(左s,dm)
    动作(110,49,0.25)
    弹(左s,dm)
    弹(加,dm)
    按(右s,dm)
    动作(350,49)
    弹(晃,dm)
    弹(右s,dm)
    按(下,dm)
    动作(87.5,49,0.25)
    
    弹(下,dm)
    按(加,dm)
    按(上,dm)
    动作(1400,49,2.25)
    
    
    弹(加,dm)
    弹(上,dm)
    
    按(左s,dm)
    按(晃,dm)
    按(板,dm)
    等(200)
    弹(左s,dm)
    弹(晃,dm)
    弹(板,dm)
    
    等(510)
    投篮(49,dm)
结束
功能 功能50(dm)
    //这个功能是 左抛投
    
    按(下,dm)
    等(600)
    按(二,dm)
    特殊投篮等(50)
    弹(下,dm)
    弹(二,dm)
    
    
结束
功能 功能51(dm)
    //这个功能是 右抛投
    
    按(下,dm)
    等(600)
    按(五,dm)
    特殊投篮等(51)
    弹(下,dm)
    弹(五,dm)
结束
功能 功能52(dm)
    //这个功能是 急停投篮
    
    
    按(上,dm)
    
    
    
    动作(400,52)
    弹(上,dm)
    按(晃,dm)
    
    按(下,dm)
    等(90)
    弹(晃,dm)
    弹(下,dm)
    投篮(52,dm)
结束
功能 功能53(dm)
    //这个功能是 原地换手鬼步
    
    
    
    
    按(左s,dm)
    动作(500,53)
    
    
    
    按(晃,dm)
    按(板,dm)
    等(300)
    
    弹(晃,dm)
    
    弹(板,dm)
    等(300)
    弹(左s,dm)
    
    等(100)
    投篮(53,dm)
结束



功能 功能54(dm)
    //这个功能是 左靠打瞬移
    等(100)
    弹(晃,dm)
    弹(加,dm)
    等(50)
    按(加,dm)
    按(晃,dm)
    按(右,dm)
    等(120)
    弹(加,dm)
    弹(右,dm)
    按(上,dm)
    等(400)
    弹(晃,dm)
    
    
    弹(上,dm)
    
结束
功能 功能55(dm)
    //这个功能是 右靠打瞬移
    
    等(100)
    弹(晃,dm)
    弹(加,dm)
    等(50)
    按(加,dm)
    按(晃,dm)
    按(左,dm)
    等(120)
    弹(加,dm)
    弹(左,dm)
    按(上,dm)
    等(400)
    弹(晃,dm)
    
    
    弹(上,dm)
    
结束
功能 功能56(dm)
    //左原地滑步
    等(200)
    按(加,dm)
    等(100)
    按(晃,dm)
    按(左,dm)
    等(35)
    弹(晃,dm)
    等(400)
    弹(加,dm)
    
    弹(左,dm)
    
    
结束
功能 功能57(dm)
    //右原地滑步
    等(200)
    按(加,dm)
    等(100)
    按(晃,dm)
    按(右,dm)
    等(35)
    弹(晃,dm)
    等(400)
    弹(加,dm)
    
    弹(右,dm)
    
    
结束
功能 功能58(dm)
    
    
    //这个功能是 右基础反瞬鬼步1
    
    按(晃,dm)
    按(加,dm)
    按(左s,dm)
    动作(110,58,0.15)
    弹(左s,dm)
    弹(加,dm)
    按(右s,dm)
    动作(930,58)
    弹(晃,dm)
    动作(127,58,0.12)
    弹(右s,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(晃,dm)
    弹(板,dm)
    等(400)
    
    投篮(58,dm)
结束
功能 功能59(dm)
    //这个功能是 进阶背运鬼步
    等(200)
    按(加,dm)
    按(右s,dm)
    等(600)
    弹(右s,dm)
    按(下,dm)
    按(右s,dm)
    等(30)
    弹(下,dm)
    弹(右s,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左s,dm)
    等(30)
    弹(下,dm)
    弹(左s,dm)
    按(左s,dm)
    等(30)
    弹(左s,dm)
    按(上,dm)
    按(左s,dm)
    等(30)
    弹(上,dm)
    弹(左s,dm)
    等(30)
    按(上,dm)
    等(30)
    弹(上,dm)
    等(200)
    按(右s,dm)
    按(晃,dm)
    等(280)
    弹(右s,dm)
    弹(晃,dm)
    弹(加,dm)
    等(380)
    按(右s,dm)
    按(晃,dm)
    按(板,dm)
    等(300)
    弹(右s,dm)
    弹(晃,dm)
    弹(板,dm)
    等(400)
    投篮(59,dm)
    
结束



功能 功能60(dm)
    //这个功能是 打断
    
结束
功能 功能61(dm)
    //这个功能是 fs传pg
    按(精,dm)
    等(55)
    按(传,dm)
    等(30)
    弹(精,dm)
    弹(传,dm)
    按(精,dm)
    等(55)
    按(传,dm)
    等(30)
    弹(精,dm)
    弹(传,dm)
    按(精,dm)
    等(55)
    按(传,dm)
    等(30)
    弹(精,dm)
    弹(传,dm)
    
    
结束
功能 功能62(dm)
    //这个功能是 fe穿sg
    按(精,dm)
    等(55)
    按(掩,dm)
    等(30)
    弹(精,dm)
    弹(掩,dm)
    按(精,dm)
    等(55)
    按(掩,dm)
    等(30)
    弹(精,dm)
    弹(掩,dm)
    按(精,dm)
    等(55)
    按(掩,dm)
    等(30)
    弹(精,dm)
    弹(掩,dm)
    
结束
功能 功能63(dm)
    //这个功能是 fd传sf
    按(精,dm)
    等(55)
    按(投,dm)
    等(35)
    弹(投,dm)
    弹(精,dm)
    按(精,dm)
    等(55)
    按(投,dm)
    等(35)
    弹(投,dm)
    弹(精,dm)
    按(精,dm)
    等(55)
    按(投,dm)
    等(35)
    弹(投,dm)
    弹(精,dm)
结束
功能 功能64(dm)
    //这个功能是 右转身
    按(上,dm)
    等(60)
    弹(上,dm)
    按(上,dm)
    按(右,dm)
    等(30)
    弹(上,dm)
    弹(右,dm)
    按(晃,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(上,dm)
    按(左,dm)
    等(30)
    弹(上,dm)
    弹(左,dm)
    等(30)
    按(上,dm)
    等(70)
    弹(上,dm)
    弹(晃,dm)
结束

功能 功能65(dm)
    //这个功能是 左转身
    按(上,dm)
    等(60)
    弹(上,dm)
    按(上,dm)
    按(左,dm)
    等(30)
    弹(上,dm)
    弹(左,dm)
    按(晃,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(上,dm)
    按(右,dm)
    等(30)
    弹(上,dm)
    弹(右,dm)
    等(30)
    按(上,dm)
    等(70)
    弹(上,dm)
    弹(晃,dm)
结束
功能 功能66(dm)
    //这个功能是 右背运
    
    按(加,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(上,dm)
    按(左,dm)
    等(30)
    弹(上,dm)
    弹(左,dm)
    等(30)
    按(上,dm)
    等(30)
    弹(上,dm)
    弹(加,dm)
结束
功能 功能67(dm)
    //这个功能是 左背运
    
    按(加,dm)
    按(左,dm)
    等(30)
    弹(左,dm)
    按(下,dm)
    按(左,dm)
    等(30)
    弹(下,dm)
    弹(左,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(右,dm)
    等(30)
    弹(下,dm)
    弹(右,dm)
    按(右,dm)
    等(30)
    弹(右,dm)
    按(上,dm)
    按(右,dm)
    等(30)
    弹(上,dm)
    弹(右,dm)
    等(30)
    按(上,dm)
    等(30)
    弹(上,dm)
    弹(加,dm)
结束
功能 功能68(dm)
    //这个功能是 梦幻脚步1
    按(晃,dm)
    等(100)
    按(下,dm)
    等(70)
    按(一,dm)
    等(110)
    弹(一,dm)
    等(290)
    按(一,dm)
    等(400)
    弹(一,dm)
    弹(晃,dm)
    弹(下,dm)
结束
功能 功能69(dm)
    //这个功能是 梦幻脚步2
    按(晃,dm)
    等(100)
    按(下,dm)
    等(80)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(400)
    弹(三,dm)
    弹(晃,dm)
    弹(下,dm)
结束
功能 功能70(dm)
    //这个功能是 梦幻晃四次
    按(晃,dm)
    等(100)
    按(下,dm)
    等(80)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(400)
    弹(三,dm)
    弹(晃,dm)
    弹(下,dm)
结束
功能 功能71(dm)
    
    
结束
功能 功能72(dm)
    //这个功能是 右连招1
    等(300)
    按(晃,dm)
    按(加,dm)
    按(右s,dm)
    按(下,dm)
    等(300)
    弹(下,dm)
    弹(右s,dm)
    等(300)
    弹(晃,dm)
    弹(加,dm)
    等(100)
    按(加,dm)
    按(晃,dm)
    按(左s,dm)
    等(120)
    弹(加,dm)
    弹(左s,dm)
    按(上,dm)
    等(880)
    弹(晃,dm)
    弹(上,dm)
    弹(加,dm)
    按(上,dm)
    按(晃,dm)
    按(右s,dm)
    等(30)
    弹(上,dm)
    弹(右s,dm)
    按(右s,dm)
    等(30)
    弹(右s,dm)
    按(下,dm)
    按(右s,dm)
    等(30)
    弹(下,dm)
    弹(右s,dm)
    按(下,dm)
    等(30)
    弹(下,dm)
    按(下,dm)
    按(左s,dm)
    等(30)
    弹(下,dm)
    弹(左s,dm)
    按(左s,dm)
    等(30)
    弹(左s,dm)
    按(上,dm)
    按(左s,dm)
    等(30)
    弹(上,dm)
    弹(左s,dm)
    等(30)
    按(上,dm)
    等(30)
    弹(上,dm)
    弹(晃,dm)
    等(1100)
    按(晃,dm)
    等(300)
    按(五,dm)
    等(90)
    弹(五,dm)
    等(290)
    按(二,dm)
    等(90)
    弹(二,dm)
    等(290)
    按(一,dm)
    等(90)
    弹(一,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(90)
    弹(三,dm)
    等(290)
    按(三,dm)
    等(725)
    弹(三,dm)
    弹(晃,dm)
    
    
结束
功能 功能73(dm)
    
    //小丑步
    
    按(加,dm)
    
    按(下,dm)
    等(390)
    
    按(晃,dm)
    等(30)
    弹(晃,dm)
    按(晃,dm)
    等(30)
    弹(晃,dm)
    弹(加,dm)
    弹(下,dm)
结束
功能 功能74(dm)
    
    
    
    //小丑步连招
    按(加,dm)
    
    等(200)
    按(右s,dm)
    
    按(下,dm)
    等(400)
    按(晃,dm)
    等(30)
    弹(晃,dm)
    按(晃,dm)
    等(30)
    弹(晃,dm)
    
    弹(加,dm)
    弹(下,dm)
    弹(右s,dm)
    
    等(100) 
    
    
    按(上,dm)
    等(1000)
    按(右s,dm)
    等(200)
    按(晃,dm)
    按(一,dm)
    等(305)
    弹(右s,dm)
    弹(上,dm)
    弹(晃,dm)
    弹(一,dm)
    
    
结束


