变量 配置路径 //全局变量
功能 设置配置路径()
    配置路径 = 系统获取进程路径() & "Config_x.ini"
结束
//主界面 主配置
功能 RC()
    变量 type = 数组("textBox", "radioButton", "checkBox", "button", "comboBox", "L", "H", "label")
    变量 size = 数组大小(type)
    遍历(变量 i = 0; i < size; i++)
        遍历(变量 j = 0; j < 文件读配置(type[i], "len", 配置路径); j++)
            变量 control = 文件读配置(type[i], j, 配置路径)
            选择(i)
                条件 0
                编辑框设置文本("编辑框" & j, control)
                条件 1
                如果(control)
                    单选框设置状态("单选框" & j, 真)
                否则
                    单选框设置状态("单选框" & j, 假)
                结束
                条件 2
                如果(control)
                    复选框设置状态("复选框" & j, 真)
                否则
                    复选框设置状态("复选框" & j, 假)
                结束
                条件 3
                按钮设置文本("按钮" & j, control)
                条件 4
                下拉框设置选项("下拉框" & j, control)
                条件 5
                浏览框设置文本("浏览框" & j, control)
                条件 6
                变量 control1 = 文件读配置("H1", j, 配置路径)
                变量 control2 = 文件读配置("H2", j, 配置路径)
                热键设置键码("热键" & j, control1, control2)
                条件 7
                标签设置文本("标签" & j, control)
            结束
        结束
    结束
    GRC()
结束
功能 WC()
    变量 type = 数组("编辑框", "单选框", "复选框", "按钮", "下拉框", "浏览框", "热键", "标签")
    变量 size = 数组大小(type)
    遍历(变量 i = 0; i < size; i++)
        变量 n = 0
        循环(真)
            变量 control = 控件获取句柄(type[i] & n)
            如果(control == 0)
                跳出
            否则
                选择(i)
                    条件 0
                    变量 ret = 编辑框获取文本("编辑框" & n)
                    文件写配置("textBox", "len", n + 1, 配置路径)
                    文件写配置("textBox", n, ret, 配置路径)
                    条件 1
                    变量 ret = 单选框获取状态("单选框" & n)
                    文件写配置("radioButton", "len", n + 1, 配置路径)
                    文件写配置("radioButton", n, ret, 配置路径)
                    条件 2
                    变量 ret = 复选框获取状态("复选框" & n)
                    文件写配置("checkBox", "len", n + 1, 配置路径)
                    文件写配置("checkBox", n, ret, 配置路径)
                    条件 3
                    变量 ret = 按钮获取文本("按钮" & n)
                    文件写配置("button", "len", n + 1, 配置路径)
                    文件写配置("button", n, ret, 配置路径)
                    条件 4
                    变量 ret = 下拉框获取选项("下拉框" & n)
                    文件写配置("comboBox", "len", n + 1, 配置路径)
                    文件写配置("comboBox", n, ret, 配置路径)
                    条件 5
                    变量 ret = 浏览框获取文本("浏览框" & n)
                    文件写配置("L", "len", n + 1, 配置路径)
                    文件写配置("L", n, ret, 配置路径)
                    条件 6
                    变量 x, y
                    热键获取键码("热键" & n, x, y)
                    文件写配置("H", "len", n + 1, 配置路径)
                    文件写配置("H1", n, x, 配置路径)
                    文件写配置("H2", n, y, 配置路径)
                    条件 7
                    变量 ret = 标签获取文本("标签" & n)
                    文件写配置("label", "len", n + 1, 配置路径)
                    文件写配置("label", n, ret, 配置路径)
                结束
                n = n + 1
            结束
        结束
    结束
    GWC()
结束//主界面 主配置——结束
//主界面 高级配置
功能 GRC()
    编辑框设置文本("bj_dqyc", 文件读配置("gjtl", "dqyc", 配置路径))
    热键设置键码("rj_tlrj", 文件读配置("rj_tlrj", "H1", 配置路径), 文件读配置("rj_tlrj", "H2", 配置路径))
    热键设置键码("rj_yczj", 文件读配置("rj_yczj", "H1", 配置路径), 文件读配置("rj_yczj", "H2", 配置路径))
    热键设置键码("rj_ycjs", 文件读配置("rj_ycjs", "H1", 配置路径), 文件读配置("rj_ycjs", "H2", 配置路径))
    热键设置键码("rj_tlsjzj", 文件读配置("rj_tlsjzj", "H1", 配置路径), 文件读配置("rj_tlsjzj", "H2", 配置路径))
    热键设置键码("rj_tlsjjs", 文件读配置("rj_tlsjjs", "H1", 配置路径), 文件读配置("rj_tlsjjs", "H2", 配置路径))
    热键设置键码("rj_dzsjzj", 文件读配置("rj_dzsjzj", "H1", 配置路径), 文件读配置("rj_dzsjzj", "H2", 配置路径))
    热键设置键码("rj_dzsjjs", 文件读配置("rj_dzsjjs", "H1", 配置路径), 文件读配置("rj_dzsjjs", "H2", 配置路径))
    热键设置键码("rj_xggbzy", 文件读配置("rj_xggbzy", "H1", 配置路径), 文件读配置("rj_xggbzy", "H2", 配置路径))
    如果(文件读配置("gjtl", "tlkg", 配置路径) == 1)
        复选框设置状态("fx_tlkg")
    否则
        复选框设置状态("fx_tlkg", 假)
    结束
    如果(文件读配置("gjtl", "xfckg", 配置路径) == 1)
        复选框设置状态("fx_xfckg")
    否则
        复选框设置状态("fx_xfckg", 假)
    结束
结束
功能 GWC()
    变量 x, y, x1, y1, x2, y2, x3, y3, x4, y4, x5, y5, x6, y6, x7, y7
    热键获取键码("rj_tlrj", x, y)
    热键获取键码("rj_yczj", x1, y1)
    热键获取键码("rj_ycjs", x2, y2)
    热键获取键码("rj_tlsjzj", x3, y3)
    热键获取键码("rj_tlsjjs", x4, y4)
    热键获取键码("rj_dzsjzj", x5, y5)
    热键获取键码("rj_dzsjjs", x6, y6)
    热键获取键码("rj_xggbzy", x7, y7)
    文件写配置("rj_tlrj", "H1", x, 配置路径)
    文件写配置("rj_tlrj", "H2", y, 配置路径)
    文件写配置("rj_yczj", "H1", x1, 配置路径)
    文件写配置("rj_yczj", "H2", y1, 配置路径)
    文件写配置("rj_ycjs", "H1", x2, 配置路径)
    文件写配置("rj_ycjs", "H2", y2, 配置路径)
    文件写配置("rj_tlsjzj", "H1", x3, 配置路径)
    文件写配置("rj_tlsjzj", "H2", y3, 配置路径)
    文件写配置("rj_tlsjjs", "H1", x4, 配置路径)
    文件写配置("rj_tlsjjs", "H2", y4, 配置路径)
    文件写配置("rj_dzsjzj", "H1", x5, 配置路径)
    文件写配置("rj_dzsjzj", "H2", y5, 配置路径)
    文件写配置("rj_dzsjjs", "H1", x6, 配置路径)
    文件写配置("rj_dzsjjs", "H2", y6, 配置路径)
    文件写配置("rj_xggbzy", "H1", x7, 配置路径)
    文件写配置("rj_xggbzy", "H2", y7, 配置路径)
    文件写配置("gjtl", "tlkg", 复选框获取状态("fx_tlkg"), 配置路径)
    文件写配置("gjtl", "xfckg", 复选框获取状态("fx_xfckg"), 配置路径)
    文件写配置("gjtl", "dqyc", 编辑框获取文本("bj_dqyc"), 配置路径)
结束//主界面 高级配置——结束
//设置界面
功能 键值写入配置()
    变量 x, y
    遍历(变量 i = 76; i < 94; i++)
        热键获取键码("热键" & i, x, y, "设置界面")
        文件写配置("H1", i, x, 配置路径)
        文件写配置("H2", i, y, 配置路径)
    结束
结束
功能 键值读取配置()
    遍历(变量 i = 76; i < 94; i++)
        热键设置键码("热键" & i, 文件读配置("H1", i, 配置路径), 文件读配置("H2", i, 配置路径), "设置界面")
    结束
结束//设置界面结束